__author__ = 'Файзрахманова Ирина Сергеевна'

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)'

# Я знаю только одно число равное
# самому себе возведенному в квадрат и помноженному на два
# Это ноль.
# Но ноль не может быть больше 999999, как бы я ни пыталась записать ноль
# Увы.


